<a href="https://colab.research.google.com/github/stutis28/PythonPractise/blob/master/Pandas_FeatureEngineering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/titanic.csv"
df = pd.read_csv(file_name)

In [6]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [0]:
def get_family_size(sibsp,parch):
  family_size = sibsp + parch
  return family_size

df['family_size'] = df[['sibsp','parch']].apply(lambda x: get_family_size(x['sibsp'],x['parch']), axis = 1)

In [8]:
df.head()

   pclass  ... family_size
0       1  ...           0
1       1  ...           3
2       1  ...           3
3       1  ...           3
4       1  ...           3

[5 rows x 12 columns]